INSERT INTO [dbo].[Visitor] (VisitorID,Фамилия, Имя, Отчество, [Номер телефона], email, [Название Организации], [Дата рождения], [Паспорт], [Request])
VALUES
(1,'Степанова', 'Радинка', 'Власовна', '+7 (613) 272-60-62', 'Radinka100@yandex.ru', 'asd', '1986-10-18', '0208530509', 1),
(2,'Шилов', 'Прохор', 'Герасимович', '+7 (615) 594-77-66', 'Prohor156@list.ru', 'asdqwe', '1977-10-09', '3036796488', 2),
(3,'Кононов', 'Юрин', 'Романович', '+7 (784) 673-51-91', 'YUrin155@gmail.com', 'asdsaw', '1971-10-08', '2747790512', 3),
(4,'Елисеева', 'Альбина', 'Николаевна', '+7 (654) 864-77-46', 'Aljbina33@lenta.ru','asdfhh', '1983-02-15', '5241213304', 4),
(5,'Шарова', 'Клавдия', 'Макаровна', '+7 (822) 525-82-40', 'Klavdiya113@live.com', 'asd11', '1980-07-22', '8143593309', 5),
(6,'Сидорова', 'Тамара', 'Григорьевна', '+7 (334) 692-79-77', 'Tamara179@live.com', 'asd243', '1995-11-22', '8143905520', 6),
(7,'Петухов', 'Тарас', 'Фадеевич', '+7 (376) 220-62-51', 'Taras24@rambler.ru', 'asdyyy', '1991-01-05', '1609171096', 7),
(8,'Родионов', 'Аркадий', 'Власович', '+7 (491) 696-17-11', 'Arkadij123@inbox.ru', 'asdaefw', '1993-08-11', '3841642594', 8),
(9,'Горшкова', 'Глафира', 'Валентиновна', '+7 (553) 343-38-82', 'Glafira73@outlook.com', 'asdasadw', '1978-05-25', '9170402601', 9),
(10,'Кириллова', 'Гавриила', 'Яковна', '+7 (648) 700-43-34', 'Gavriila68@msn.com', 'asdwer23', '1992-04-26', '9438379667', 10),
(11,'Овчинников', 'Кузьма', 'Ефимович', '+7 (562) 866-15-27', 'Kuzjma124@yandex.ru', 'asdkjhyt', '1993-08-02', '0766647226', 11),
(12,'Беляков', 'Роман', 'Викторович', '+7 (595) 196-56-28', 'Roman89@gmail.com', 'asdsadwq', '1991-06-07', '2411478305', 12),
(13,'Лыткин', 'Алексей', 'Максимович', '+7 (994) 353-29-52', 'Aleksej43@gmail.com', 'asd', '1996-03-07', '2383259825', 13),
(14,'Шубина', 'Надежда', 'Викторовна', '+7 (736) 488-66-95', 'Nadezhda137@outlook.com', 'asd', '1981-09-24', '8844708476', 14),
(15,'Зиновьева', 'Бронислава', 'Викторовна', '+7 (778) 565-12-18', 'Bronislava56@yahoo.com', 'asd', '1981-03-19', '6736319423', 15);

INSERT INTO [dbo].[GroupMember] (MemberID,GroupID, Фамилия, Имя, Отчество, [Телефон], email, [Организация], [День рождения], [Паспорт], [Фото])
VALUES
(1,1,'Самойлова', 'Таисия', 'Гермоновна', '+7 (891) 555-81-44', 'Taisiya177@lenta.ru', NULL, '1979-11-14', '5193897719', NULL),
(2,2,'Ситникова', 'Аделаида', 'Гермоновна', '+7 (793) 736-70-31', 'Adelaida20@hotmail.com', NULL, '1979-01-21', '7561148016', NULL),
(3,3,'Исаев', 'Лев', 'Юлианович', '+7 (675) 593-89-30', 'Lev131@rambler.ru', NULL, '1994-08-05', '1860680004', NULL),
(4,4,'Никифоров', 'Даниил', 'Степанович', '+7 (384) 358-77-82', 'Daniil198@bk.ru', NULL, '1970-12-13', '4557999958', NULL),
(5,5,'Титова', 'Людмила', 'Якововна', '+7 (221) 729-16-84', 'Lyudmila123@hotmail.com', NULL, '1976-08-21', '7715639425', NULL),
(6,6,'Абрамова', 'Таисия', 'Дмитриевна', '+7 (528) 312-18-20', 'Taisiya176@hotmail.com', NULL, '1982-11-20', '7310893510', NULL),
(7,7,'Кузьмина', 'Вера', 'Максимовна', '+7 (598) 583-53-45', 'Vera195@list.ru', NULL, '1989-12-10', '3537982933', NULL),
(8,8,'Мартынов', 'Яков', 'Ростиславович', '+7 (546) 159-67-33', 'YAkov196@rambler.ru', NULL, '1976-12-05', '1793986063', NULL),
(9,9,'Евсеева', 'Нина', 'Павловна', '+7 (833) 521-31-50', 'Nina145@msn.com', NULL, '1994-09-26', '9323745717', NULL),
(10,10,'Голубев', 'Леонтий', 'Вячеславович', '+7 (160) 527-57-41', 'Leontij161@mail.ru', NULL, '1990-10-03', '1059822077', NULL),
(11,11,'Карпова', 'Серафима', 'Михаиловна', '+7 (459) 930-91-70', 'Serafima169@yahoo.com', NULL, '1989-11-19', '7034858987', NULL),
(12,12,'Орехов', 'Сергей', 'Емельянович', '+7 (669) 603-29-87', 'Sergej35@inbox.ru', NULL, '1972-02-11', '3844223682', NULL),
(13,13,'Исаев', 'Георгий', 'Павлович', '+7 (678) 516-36-86', 'Georgij121@inbox.ru', NULL, '1987-08-11', '4076629809', NULL),
(14,14,'Богданов', 'Елизар', 'Артемович', '+7 (165) 768-30-97', 'Elizar30@yandex.ru', NULL, '1978-02-02', '0573198559', NULL),
(15,15,'Тихонова', 'Лана', 'Семеновна', '+7 (478) 467-75-15', 'Lana117@outlook.com', NULL, '1990-07-24', '8761609740', NULL);

INSERT INTO [dbo].[Employees] (EmployeeId, Фамилия, Имя, Отчество, DepartmentID, Позиция)
VALUES
(1,'Фомичева', 'Авдотья', 'Трофимовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Производство'), NULL),
(2,'Гаврилова', 'Римма', 'Ефимовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Сбыт'), NULL),
(3,'Носкова', 'Наталия', 'Прохоровна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Администрация'), NULL),
(4,'Архипов', 'Тимофей', 'Васильевич', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Служба безопасности'), NULL),
(5,'Орехова', 'Вероника', 'Артемовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Планирование'), NULL),
(6,'Савельев', 'Павел', 'Степанович', NULL, 'Общий отдел'),
(7,'Чернов', 'Всеволод', 'Наумович', NULL, 'Охрана'),
(8,'Марков', 'Юрий', 'Романович', NULL, NULL);

INSERT INTO [dbo].[VisitorGroups] (GroupID, [Request ID], [Номер группы], Логин, пароль)
VALUES
(1, 1, 1,111,111),
(2, 2, 2,222,222),
(3, 3, 3,333,333);


INSERT INTO [dbo].[AccessRequests] (RequestID, UserID, RequestType, RecipientEmployeeID, StartDate, EndDate, Purpose, Status)
VALUES
(1, 1, 1, 1, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает'),
(2, 2, 1, 2, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает'),
(3, 3, 1, 3, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает');

INSERT INTO [dbo].[GroupVisitID] (GroupVisitID, RequestID, [Начальная дата], [конечная дата], RecipientEmployeeID)
VALUES
(1, 1, '2023-04-24', '2023-04-24', 1),
(2, 2, '2023-04-24', '2023-04-24', 2),
(3, 3, '2023-04-24', '2023-04-24', 3);

INSERT INTO [dbo].[Department] (DepartamentID, DepartamentName)
VALUES
(1, 'Производство'),
(2, 'Сбыт'),
(3, 'Администрация'),
(4, 'Служба безопасности'),
(5, 'Планирование');

INSERT INTO [dbo].[Users] (UserId, email, Пароль, Роль)
VALUES
(2, 'Radinka100@yandex.ru', 'b3uWS6#Thuvq', 'Пользователь'),
(3, 'Prohor156@list.ru', 'zDdom}SIhWs?', 'Пользователь'),
(4, 'YUrin155@gmail.com', 'u@m*~ACBCqNQ', 'Пользователь');