INSERT INTO [dbo].[Visitor] (Фамилия, Имя, Отчество, [Номер телефона], email, [Название Организации], [Дата рождения], [Паспорт], [Request])
VALUES
('Степанова', 'Радинка', 'Власовна', '+7 (613) 272-60-62', 'Radinka100@yandex.ru', NULL, '1986-10-18', '0208 530509', NULL),
('Шилов', 'Прохор', 'Герасимович', '+7 (615) 594-77-66', 'Prohor156@list.ru', NULL, '1977-10-09', '3036 796488', NULL),
('Кононов', 'Юрин', 'Романович', '+7 (784) 673-51-91', 'YUrin155@gmail.com', NULL, '1971-10-08', '2747 790512', NULL),
('Елисеева', 'Альбина', 'Николаевна', '+7 (654) 864-77-46', 'Aljbina33@lenta.ru', NULL, '1983-02-15', '5241 213304', NULL),
('Шарова', 'Клавдия', 'Макаровна', '+7 (822) 525-82-40', 'Klavdiya113@live.com', NULL, '1980-07-22', '8143 593309', NULL),
('Сидорова', 'Тамара', 'Григорьевна', '+7 (334) 692-79-77', 'Tamara179@live.com', NULL, '1995-11-22', '8143 905520', NULL),
('Петухов', 'Тарас', 'Фадеевич', '+7 (376) 220-62-51', 'Taras24@rambler.ru', NULL, '1991-01-05', '1609 171096', NULL),
('Родионов', 'Аркадий', 'Власович', '+7 (491) 696-17-11', 'Arkadij123@inbox.ru', NULL, '1993-08-11', '3841 642594', NULL),
('Горшкова', 'Глафира', 'Валентиновна', '+7 (553) 343-38-82', 'Glafira73@outlook.com', NULL, '1978-05-25', '9170 402601', NULL),
('Кириллова', 'Гавриила', 'Яковна', '+7 (648) 700-43-34', 'Gavriila68@msn.com', NULL, '1992-04-26', '9438 379667', NULL),
('Овчинников', 'Кузьма', 'Ефимович', '+7 (562) 866-15-27', 'Kuzjma124@yandex.ru', NULL, '1993-08-02', '0766 647226', NULL),
('Беляков', 'Роман', 'Викторович', '+7 (595) 196-56-28', 'Roman89@gmail.com', NULL, '1991-06-07', '2411 478305', NULL),
('Лыткин', 'Алексей', 'Максимович', '+7 (994) 353-29-52', 'Aleksej43@gmail.com', NULL, '1996-03-07', '2383 259825', NULL),
('Шубина', 'Надежда', 'Викторовна', '+7 (736) 488-66-95', 'Nadezhda137@outlook.com', NULL, '1981-09-24', '8844 708476', NULL),
('Зиновьева', 'Бронислава', 'Викторовна', '+7 (778) 565-12-18', 'Bronislava56@yahoo.com', NULL, '1981-03-19', '6736 319423', NULL);

INSERT INTO [dbo].[GroupMember] (Фамилия, Имя, Отчество, [Телефон], email, [Организация], [День рождения], [Паспорт], [Фото], [GroupID])
VALUES
('Самойлова', 'Таисия', 'Гермоновна', '+7 (891) 555-81-44', 'Taisiya177@lenta.ru', NULL, '1979-11-14', '5193 897719', NULL, NULL),
('Ситникова', 'Аделаида', 'Гермоновна', '+7 (793) 736-70-31', 'Adelaida20@hotmail.com', NULL, '1979-01-21', '7561 148016', NULL, NULL),
('Исаев', 'Лев', 'Юлианович', '+7 (675) 593-89-30', 'Lev131@rambler.ru', NULL, '1994-08-05', '1860 680004', NULL, NULL),
('Никифоров', 'Даниил', 'Степанович', '+7 (384) 358-77-82', 'Daniil198@bk.ru', NULL, '1970-12-13', '4557 999958', NULL, NULL),
('Титова', 'Людмила', 'Якововна', '+7 (221) 729-16-84', 'Lyudmila123@hotmail.com', NULL, '1976-08-21', '7715 639425', NULL, NULL),
('Абрамова', 'Таисия', 'Дмитриевна', '+7 (528) 312-18-20', 'Taisiya176@hotmail.com', NULL, '1982-11-20', '7310 893510', NULL, NULL),
('Кузьмина', 'Вера', 'Максимовна', '+7 (598) 583-53-45', 'Vera195@list.ru', NULL, '1989-12-10', '3537 982933', NULL, NULL),
('Мартынов', 'Яков', 'Ростиславович', '+7 (546) 159-67-33', 'YAkov196@rambler.ru', NULL, '1976-12-05', '1793 986063', NULL, NULL),
('Евсеева', 'Нина', 'Павловна', '+7 (833) 521-31-50', 'Nina145@msn.com', NULL, '1994-09-26', '9323 745717', NULL, NULL),
('Голубев', 'Леонтий', 'Вячеславович', '+7 (160) 527-57-41', 'Leontij161@mail.ru', NULL, '1990-10-03', '1059 822077', NULL, NULL),
('Карпова', 'Серафима', 'Михаиловна', '+7 (459) 930-91-70', 'Serafima169@yahoo.com', NULL, '1989-11-19', '7034 858987', NULL, NULL),
('Орехов', 'Сергей', 'Емельянович', '+7 (669) 603-29-87', 'Sergej35@inbox.ru', NULL, '1972-02-11', '3844 223682', NULL, NULL),
('Исаев', 'Георгий', 'Павлович', '+7 (678) 516-36-86', 'Georgij121@inbox.ru', NULL, '1987-08-11', '4076 629809', NULL, NULL),
('Богданов', 'Елизар', 'Артемович', '+7 (165) 768-30-97', 'Elizar30@yandex.ru', NULL, '1978-02-02', '0573 198559', NULL, NULL),
('Тихонова', 'Лана', 'Семеновна', '+7 (478) 467-75-15', 'Lana117@outlook.com', NULL, '1990-07-24', '8761 609740', NULL, NULL);

INSERT INTO [dbo].[Employees] (Фамилия, Имя, Отчество, DepartmentID, Позиция)
VALUES
('Фомичева', 'Авдотья', 'Трофимовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Производство'), NULL),
('Гаврилова', 'Римма', 'Ефимовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Сбыт'), NULL),
('Носкова', 'Наталия', 'Прохоровна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Администрация'), NULL),
('Архипов', 'Тимофей', 'Васильевич', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Служба безопасности'), NULL),
('Орехова', 'Вероника', 'Артемовна', (SELECT DepartamentID FROM [dbo].[Department] WHERE DepartamentName = 'Планирование'), NULL),
('Савельев', 'Павел', 'Степанович', NULL, 'Общий отдел'),
('Чернов', 'Всеволод', 'Наумович', NULL, 'Охрана'),
('Марков', 'Юрий', 'Романович', NULL, NULL);

INSERT INTO [dbo].[VisitorGroups] (GroupID, [Request ID], [Номер группы])
VALUES
(1, NULL, 1),
(2, NULL, 2),
(3, NULL, 3);

INSERT INTO [dbo].[AccessRequests] (RequestID, UserID, RequestType, RecipientEmployeeID, StartDate, EndDate, Purpose, Status)
VALUES
(1, 1, 1, 1, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает'),
(2, 2, 1, 2, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает'),
(3, 3, 1, 3, '2023-04-24', '2023-04-24', 'Посещение', 'Ожидает');

INSERT INTO [dbo].[GroupVisitID] (GroupVisitID, RequestID, [Начальная дата], [конечная дата], RecipientEmployeeID)
VALUES
(1, 1, '2023-04-24', '2023-04-24', 1),
(2, 2, '2023-04-24', '2023-04-24', 2),
(3, 3, '2023-04-24', '2023-04-24', 3);

INSERT INTO [dbo].[Department] (DepartamentID, DepartamentName)
VALUES
(1, 'Производство'),
(2, 'Сбыт'),
(3, 'Администрация'),
(4, 'Служба безопасности'),
(5, 'Планирование');

INSERT INTO [dbo].[Users] (UserId, email, Пароль, Роль)
VALUES
(2, 'Radinka100@yandex.ru', 'b3uWS6#Thuvq', 'Пользователь'),
(3, 'Prohor156@list.ru', 'zDdom}SIhWs?', 'Пользователь'),
(4, 'YUrin155@gmail.com', 'u@m*~ACBCqNQ', 'Пользователь');